src/Enums/ar_RiskLevel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_RiskLevel</Name>
			<Comment>Уровень риска инструмента (tool) агента: от безопасного чтения до необратимых операций</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Read</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Draft</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Write</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Commit</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ar_Tools.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Tools</Name>
			<Comment>Реестр инструментов (tools) агентов AgentRunner. META-12.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Имя</Name>
					<Comment>Идентификатор tool в snake_case (search_clients). Уникален, проверяется в ОбработкаПроверкиЗаполнения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Представление</Name>
					<Comment>Короткое человекочитаемое название tool для попапа композера (UI). Если пусто - показывается ar_Имя.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Описание</Name>
					<Comment>Краткое описание tool для отображения в UI списка.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_JSONManifest</Name>
					<Comment>Манифест tool в формате JSON Schema (name, description, parameters). Передаётся LLM.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_RiskLevel</Name>
					<Comment>Уровень риска вызова tool (Low/Medium/High/Critical). META-06.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ar_УровеньРиска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ОбщийМодуль</Name>
					<Comment>Имя общего модуля-реализации (например aosToolCRM). Используется диспетчером aosToolDispatcher.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИмяПроцедуры</Name>
					<Comment>Имя экспортной процедуры внутри общего модуля (например search_clients).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТребуетApproval</Name>
					<Comment>Если Истина — вызов tool ставится в очередь ar_ОчередьApproval вместо немедленного выполнения.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включён</Name>
					<Comment>Признак активности tool. Неактивные tools игнорируются диспетчером и не передаются LLM.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ЗамерПроизводительности</Name>
					<Comment>Включить замер БСП («Оценка производительности») для этого инструмента. Ключевая операция передаётся строкой "ar_Tool_&lt;ar_Имя&gt;" — БСП создаёт элемент справочника КлючевыеОперации лениво при первом замере, отдельного действия не требуется. Реальная запись происходит только если ОБА условия истинны: этот флаг (или константа ar_ЗамерятьВсеTools) И глобальный переключатель БСП «Выполнять замеры производительности» (Администрирование). Недоступен, если в конфигурации нет подсистемы «Оценка производительности».</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Версия</Name>
					<Comment>SemVer реализации tool (например 1.0.0). Используется для отладки и совместимости.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникРасширение</Name>
					<Comment>Имя расширения, добавившего tool. Пусто = ядро AgentRunner. Заполняется Expert Pack при инициализации.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТипРеализации</Name>
					<Comment>Режим реализации tool: «Процедура» (пусто = Процедура, общий модуль + процедура) или «Код» (произвольный код 1С из ar_КодРеализации).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_КодРеализации</Name>
					<Comment>Произвольный код 1С tool (ar_ТипРеализации = «Код»). Выполняется диспетчером ar_ToolDispatcher через Выполнить() в безопасном режиме. SEC-TOOL-01: безопасный режим НЕ гарантирует блокировку чтения данных сессии, записи в обход ar_ОчередьApproval и HTTP-эксфильтрации — диспетчеризация требует явного разрешения администратора (константа ar_РазрешитьТулыВРежимеКод, по умолчанию Ложь). См. .docs/Модель-угроз-режим-Код.md.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТребуемыеОбъекты</Name>
					<Comment>JSON-массив логических имён объектов метаданных (например ["СчетНаОплатуПокупателю","Контрагенты"]), без которых tool не может отработать. Проверяется через ar_ToolDispatcher.ИмяОбъектаМетаданных + Метаданные.Документы.Найти()/Метаданные.Справочники.Найти(). Пусто или [] — tool не привязан к предметным объектам (универсальный, всегда доступен по этому критерию).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПоддерживаемыеКонфигурации</Name>
					<Comment>Список типов конфигурации через запятую (например "БП,УТ"), на которых tool имеет смысл. Пусто — любая конфигурация. Проверяется в ar_ToolDispatcher.ПроверитьДоступностьTool сравнением с ar_ПрофильКонфигурации.ОпределитьКонфигурацию().Тип (UNIV-01); результат кэшируется в ar_Доступен.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Доступен</Name>
					<Comment>Вычисляемый кэш результата ar_ToolDispatcher.ПроверитьДоступностьTool() — НЕ воля администратора. Обновляется автоматически при ЗарегистрироватьВсеTools() и при обновлении версии расширения. В отличие от ar_Включён (которое администратор выставляет вручную, чтобы отключить рабочий tool), ar_Доступен = Ложь означает «физически не может отработать на этой базе» — администратор это поле не редактирует руками. Фильтруется в ar_RuntimeКонтекст.СобратьОпределенияTools.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПричинаНедоступности</Name>
					<Comment>Хранимый кэш причины ar_Доступен = Ложь для отображения в форме списка без захода в карточку. Заполняется в той же точке, что и ar_Доступен (ar_ToolDispatcher.ПроверитьДоступностьTool/ПересчитатьДоступностьВсехTools), пересчитывается вместе с ним и быстро устаревает при изменении состава метаданных.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТребуетАдаптер</Name>
					<Comment>Истина — tool делегирует заполнение документа в ar_АдаптерЗаполнения; доступность (ar_Доступен) дополнительно зависит от наличия зарегистрированного и включённого адаптера для текущего типа конфигурации (см. ar_АдаптерЗаполнения.ЕстьАдаптерДляТекущейКонфигурации). Не путать с ar_ТребуемыеОбъекты — то проверяет наличие объектов метаданных, это — наличие кода-адаптера.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Категория</Name>
					<Comment>Технический код группы (finance, documents, ... - см. Справочник.ar_КатегорииTools.Код), не готовый для показа текст. Заполняется ar_ToolDispatcher.ЗаполнитьПредставленияВсехTools. Человекочитаемое название - в ar_КатегорииTools.Наименование (SCALE-01).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникТип</Name>
					<Comment>Откуда берётся реализация tool: «Ядро» (пара ar_ОбщийМодуль+ar_ИмяПроцедуры, ветвление в ar_ToolDispatcher.ВыполнитьЯдровойМодуль), «Пакет» (внешняя обработка, см. ar_ИдентификаторПакета), «Код» (устаревший режим, удаляется в SEC-TOOL-02). Пусто трактуется как «Ядро» — обратная совместимость для всех существующих записей.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИдентификаторПакета</Name>
					<Comment>Измерение регистра ar_ПакетыTools — UUID ссылки на доп. обработку. Заполнено только при ar_ИсточникТип = «Пакет». Для ядровых tools пусто.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Namespace</Name>
					<Comment>Префикс имени tool для пакетных tools. Для ядровых пусто.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_КраткоеОписание</Name>
					<Comment>Короткое описание с ключевыми словами в формулировках пользователя (не терминах метаданных) — для карты категорий и поиска find_tools (SCALE-02/SCALE-03). В блоке A заполняется из манифеста пакета, поиском ещё не используется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ВсегдаВКонтексте</Name>
					<Comment>Tool всегда попадает в набор определений LLM, минуя прогрессивную выдачу (SCALE-05, Уровень 0). В блоке A заводится, но не читается — опережающая миграция схемы, чтобы SCALE-05 не требовал повторного meta-edit.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МинВерсияКонфигурации</Name>
					<Comment>Минимальная версия целевой конфигурации, на которой tool работоспособен, строго в 4-разрядном формате (например "3.0.180.0"). Пусто — без ограничения. Сравнение — ОбщегоНазначенияКлиентСервер.СравнитьВерсии. Имеет смысл только вместе с ar_ПоддерживаемыеКонфигурации.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МаксВерсияКонфигурации</Name>
					<Comment>Максимальная версия конфигурации (исключений в API, после которых tool сломан), строго в 4-разрядном формате (например "3.0.201.0"). Пусто — без ограничения. Сравнение — ОбщегоНазначенияКлиентСервер.СравнитьВерсии.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МинВерсияAgentRunner</Name>
					<Comment>Минимальная версия расширения AgentRunner, требуемая tool, строго в 4-разрядном формате (например "0.1.0.230"). Сверяется с ar_Утилиты.ВерсияРасширения() — фактической версией загруженного расширения, НЕ с константой ar_ВерсияРасширенияБД (та отражает пройденные обработчики обновления и может отставать). Пусто — без ограничения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТребуемыеПодсистемы</Name>
					<Comment>JSON-массив полных имён подсистем БСП, без которых tool не работает, например ["СтандартныеПодсистемы.Взаимодействия"]. Проверяется через ОбщегоНазначения.ПодсистемаСуществует. Пусто или [] — зависимостей от подсистем нет.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_КлючевыеСловаПараметров</Name>
					<Comment>Имена параметров tool через запятую с пробелом, извлечённые из ar_JSONManifest.function.parameters.properties автоматическим постпроходом ЗаполнитьКлючевыеСловаПараметровВсехTools при регистрации. Для поиска find_tools по словам из имени параметра (SCALE-02/SCALE-03). Не редактируется вручную — перезаписывается при каждой регистрации.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ar_ToolПлан/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_ToolПлан (Tool - план запуска).
//
// Реализует tool:
//   update_plan — объявить/обновить план работы по многоэтапной задаче (PLAN-03).
//
// S4 (шапка Tasks_plan.md): wait_for_event (PLAN-11) добавит вторую функцию в
// этот же модуль - отдельный модуль заводить не нужно (по образцу
// ar_ToolРеестрПоиск: find_tools + describe_tool в одном модуле).
//
// Контракт tool-функции:
//   Вход:  Аргументы (Строка) — JSON-объект аргументов от LLM.
//          Контекст (Структура) — КонтекстЗапуска {RunId, Агент, DryRun, ...}.
//          БЕЗ Состояние (Plan-ревью R1, ar_RuntimeЦикл.КонтекстЗапуска) - tool
//          физически не может прочитать/записать текущий план запуска.
//   Выход: Строка JSON — observation для добавления в контекст как role:tool.
//          Никогда не пустая; при ошибке — {"error":"<код>"}.
//
// Роль update_plan в этой задаче узкая: провалидировать и нормализовать
// присланные LLM пункты через ar_ПланЗапуска (без доступа к предыдущему плану -
// merge-семантика здесь не применяется буквально, вызывается
// Применить(НовыйПлан(), ПунктыИзLLM)). Настоящее слияние с историей и запись
// в ar_Запуски (событие PlanUpdated) делает цикл ar_RuntimeЦикл (PLAN-04) - вне
// скоупа этой задачи.
//
// update_plan read-only с точки зрения ИБ: не пишет в Состояние, не читает и
// не пишет РегистрСведений.ar_Запуски, HTTP не делает. Привилегированный режим
// используется ТОЛЬКО в ЗарегистрироватьTools (запись в служебный реестр
// ar_Tools) — сама выдача не требует повышенных прав (Plan §3.3).
//
// Свойства модуля: Сервер, без вызова с клиента, Привилегированный = Ложь.
//
// См. спеку: .docs/specs/PLAN-03.md, .docs/specs/PLAN-02.md, .docs/specs/PLAN-01.md.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Диспетчер второго уровня модуля ar_ToolПлан. Маршрутизирует вызов по имени
// процедуры БЕЗ Выполнить()/Вычислить(). Вызывается из
// ar_ToolDispatcher.ВыполнитьПроцедуруToolПлан.
//
// Параметры:
//  ИмяПроцедуры - Строка    - имя tool-процедуры ("ОбновитьПлан").
//  Аргументы    - Строка    - JSON-аргументы от LLM.
//  Контекст     - Структура - КонтекстЗапуска.
//
// Возвращаемое значение:
//  Строка - JSON-observation.
//
Функция Диспетчер(Знач ИмяПроцедуры, Знач Аргументы, Знач Контекст) Экспорт

	Если ИмяПроцедуры = "ОбновитьПлан" Тогда
		Возврат ОбновитьПлан(Аргументы, Контекст);
	Иначе
		Возврат ОшибочныйJSON("unknown_procedure");
	КонецЕсли;

КонецФункции

// Идемпотентно создаёт/обновляет запись реестра ar_Tools для tool update_plan
// (PLAN-03). Вызывается из ar_ToolDispatcher.ЗарегистрироватьВсеTools() и из
// обработчика обновления расширения. Привилегированный режим включается
// локально только для записи в служебный реестр ядра, с парным сбросом в
// блоке Исключение (Plan §1.3).
//
// Возвращаемое значение:
//  Структура { Создано - Число, Обновлено - Число } — статистика регистрации.
//
Функция ЗарегистрироватьTools() Экспорт

	Статистика = Новый Структура("Создано, Обновлено", 0, 0);

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ЗарегистрироватьОдинИнструмент(ОписаниеToolUpdatePlan(), Статистика);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Статистика;

КонецФункции

// Tool update_plan: провалидировать и нормализовать пункты плана,
// присланные LLM, вернуть короткий observation с планом и прогрессом.
//
// Параметры:
//  Аргументы - Строка    - JSON-аргументы от LLM. Поля:
//    steps (обяз.) - массив объектов {title: string, status: string}.
//                    status - одно из pending|in_progress|done|skipped, вне
//                    словаря/отсутствует - нормализуется в pending силами
//                    ar_ПланЗапуска.
//    note  (опц.)  - строка, комментарий агента. Не участвует в контракте
//                    ar_ПланЗапуска, маскируется и возвращается как есть.
//  Контекст  - Структура - КонтекстЗапуска {RunId, Агент, DryRun, ...}. DryRun
//              не даёт отдельной ветки: update_plan не мутирует ИБ и не
//              создаёт approval-запись, поведение то же, что и без DryRun.
//
// Возвращаемое значение:
//  Строка - JSON {"plan":[{"title":"...","status":"..."}],"progress":"N/M"
//           [,"truncated":true][,"note":"..."]} либо {"error":"<код>"}.
//
Функция ОбновитьПлан(Знач Аргументы, Знач Контекст) Экспорт

	Попытка
		Возврат ОбновитьПланВнутр(Аргументы, Контекст);
	Исключение
		ТекстОшибки = ar_Утилиты.ОчиститьОшибкуДляLLM(
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат ОшибочныйJSON("internal_error: " + ТекстОшибки);
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// update_plan: валидация и нормализация без истории.

// Основная логика tool update_plan. Выделена из ОбновитьПлан, чтобы внешний
// Попытка/Исключение ловил любые непредвиденные ошибки.
//
// Алгоритм (см. .docs/specs/PLAN-03.md, раздел «Поведение»):
//  1. Разбор АргументыJSON через ar_JSON.ИзJSON - при ошибке парсинга получаем
//     пустое Соответствие, не исключение.
//  2. Извлечение steps - если это не Массив или отсутствует, invalid_steps
//     (единственный обязательный параметр).
//  3. Извлечение note (опционально), маскировка секретов.
//  4. Передача steps в ar_ПланЗапуска.Применить(ar_ПланЗапуска.НовыйПлан(),
//     steps) - НЕ ar_ПланЗапуска.Применить(ПредыдущийПлан, ...) буквально:
//     предыдущего плана внутри tool нет (R1 - Состояние недоступно). Так
//     нормализуются и усекаются присланные пункты по тем же правилам
//     (лимиты 12/150, фильтрация мусора), но БЕЗ merge с историей.
//  5. Формирование короткого observation: plan (Результат.Пункты),
//     progress ("<Закрыто>/<Всего>" через ar_ПланЗапуска.Прогресс),
//     truncated:true при Результат.Усечено.
//
// Параметры:
//  Аргументы - Строка    - JSON-аргументы tool (см. ОбновитьПлан).
//  Контекст  - Структура - КонтекстЗапуска.
//
// Возвращаемое значение:
//  Строка - JSON-observation (см. ОбновитьПлан).
//
Функция ОбновитьПланВнутр(Знач Аргументы, Знач Контекст)

	ДанныеJSON = ar_JSON.ИзJSON(Аргументы);
	Если ТипЗнч(ДанныеJSON) <> Тип("Соответствие") Тогда
		Возврат ОшибочныйJSON("invalid_steps");
	КонецЕсли;

	СырыеШаги = ДанныеJSON.Получить("steps");
	Если ТипЗнч(СырыеШаги) <> Тип("Массив") Тогда
		Возврат ОшибочныйJSON("invalid_steps");
	КонецЕсли;

	СтрокаNote = СтрокаNoteИзАргументов(ДанныеJSON);

	// ar_JSON.ИзJSON разбирает JSON-объекты как Соответствие, а не Структура
	// (докстринг ar_JSON.ИзJSON, платформенный ПрочитатьJSON с
	// ПрочитатьВСоответствие=Истина). ar_ПланЗапуска.НормализоватьПунктLLM
	// требует строго Тип("Структура") для каждого элемента - без конвертации
	// любой корректный вход отбрасывается как мусор (ревью 1, замечание 1).
	ШагиДляПланировщика = ПривестиШагиКСтруктурам(СырыеШаги);

	// DryRun (Контекст.DryRun = Истина) сознательно НЕ даёт отдельной ветки с
	// фиктивным ответом, в отличие от ask_user: update_plan не мутирует ИБ и
	// не создаёт approval-запись, поэтому поведение одинаковое с обычным
	// вызовом (см. спеку PLAN-03, «Поведение», шаг 6).

	// Предыдущего плана внутри tool нет (R1) - НовыйПлан() как база слияния,
	// это нормализация/усечение входа LLM, а не честный merge с историей.
	Результат = ar_ПланЗапуска.Применить(ar_ПланЗапуска.НовыйПлан(), ШагиДляПланировщика);
	Прогресс   = ar_ПланЗапуска.Прогресс(Результат);

	ОтветПлан = Новый Массив;
	Для Каждого Пункт Из Результат.Пункты Цикл
		ЭлементПлана = Новый Структура;
		ЭлементПлана.Вставить("title", Пункт.Заголовок);
		ЭлементПлана.Вставить("status", Пункт.Статус);
		ОтветПлан.Добавить(ЭлементПлана);
	КонецЦикла;

	Ответ = Новый Структура;
	Ответ.Вставить("plan", ОтветПлан);
	Ответ.Вставить("progress", Строка(Прогресс.Закрыто) + "/" + Строка(Прогресс.Всего));

	Если Результат.Усечено Тогда
		Ответ.Вставить("truncated", Истина);
	КонецЕсли;

	Если СтрокаNote <> Неопределено Тогда
		Ответ.Вставить("note", СтрокаNote);
	КонецЕсли;

	Возврат ar_JSON.ВЗначениеJSON(Ответ);

КонецФункции

// Конвертирует массив сырых элементов steps (каждый - Соответствие, как их
// разбирает ar_JSON.ИзJSON) в массив Структур с полями title/status, как их
// ожидает ar_ПланЗапуска.НормализоватьПунктLLM (строгая проверка
// ТипЗнч(...) = Тип("Структура")). Элемент, который сам не является
// Соответствие (мусор внутри массива steps), передаётся дальше как есть -
// ar_ПланЗапуска отбросит его самостоятельно как невалидный тип.
//
// Экспортная (PLAN-04, уточнение U7): переиспользуется из ar_RuntimeЦикл
// (ОбработатьРезультатUpdatePlan) - та же граница типов Соответствие/Структура
// возникает при разборе observation update_plan цикла, что и здесь при разборе
// аргументов steps. Единственная точка конвертации, дублирование в третьем
// месте не допускается.
//
// Параметры:
//  СырыеШаги - Массив - элементы steps после ar_JSON.ИзJSON (обычно
//              Соответствие с ключами title/status, но тип элементов не
//              гарантирован - вход от LLM).
//
// Возвращаемое значение:
//  Массив - элементы Структура("title, status", ...) там, где конвертация
//  возможна, либо исходный элемент без изменений (для дальнейшей отбраковки
//  ar_ПланЗапуска как мусора).
//
Функция ПривестиШагиКСтруктурам(Знач СырыеШаги) Экспорт

	Результат = Новый Массив;

	// Защитная проверка типа входа (PLAN-04): функция стала экспортной и
	// вызывается из второго места (ar_RuntimeЦикл) - вызывающая сторона там
	// уже проверяет ТипЗнч(...) = Тип("Массив") перед вызовом, но повторная
	// проверка здесь не даёт функции упасть, если контракт нарушит будущий
	// вызывающий код.
	Если ТипЗнч(СырыеШаги) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого СыройЭлемент Из СырыеШаги Цикл
		// Соответствие.Получить(<Ключ>) безопасен на отсутствующем ключе -
		// работает как оператор [], возвращает Неопределено, исключения не
		// бросает (в отличие от обращения к отсутствующему реквизиту
		// Структуры через точку) - см. платформенную документацию метода.
		// Обёртка Попытка здесь избыточна.
		Если ТипЗнч(СыройЭлемент) = Тип("Соответствие") Тогда
			ЗначениеЗаголовка = СыройЭлемент.Получить("title");
			ЗначениеСтатуса   = СыройЭлемент.Получить("status");
			Структурированный = Новый Структура("title, status", ЗначениеЗаголовка, ЗначениеСтатуса);
			Результат.Добавить(Структурированный);
		Иначе
			// Не Соответствие (например Строка, Число, Массив, Неопределено) -
			// заведомый мусор, ar_ПланЗапуска.НормализоватьПунктLLM отбросит
			// его сам по проверке ТипЗнч(...) <> Тип("Структура").
			Результат.Добавить(СыройЭлемент);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Извлекает опциональное поле note из разобранных аргументов и маскирует в
// нём секреты (по аналогии с question/hint у ask_user). Отсутствующее или
// не строковое значение - Неопределено (поле не попадёт в observation).
//
// Параметры:
//  ДанныеJSON - Соответствие - разобранные аргументы tool (ar_JSON.ИзJSON).
//
// Возвращаемое значение:
//  Строка, Неопределено - замаскированный текст note либо Неопределено.
//
Функция СтрокаNoteИзАргументов(Знач ДанныеJSON)

	ЗначениеNote = ДанныеJSON.Получить("note");
	Если ТипЗнч(ЗначениеNote) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Note = СокрЛП(ЗначениеNote);
	Если ПустаяСтрока(Note) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ar_Утилиты.МаскироватьСекреты(Note);

КонецФункции

// JSON-строка ошибки-observation: {"error":"<текст>"}.
//
// Параметры:
//  ТекстОшибки - Строка - код/текст ошибки.
//
// Возвращаемое значение:
//  Строка - JSON {"error":"<текст>"}.
//
Функция ОшибочныйJSON(Знач ТекстОшибки)
	Объект = Новый Структура;
	Объект.Вставить("error", ?(ТипЗнч(ТекстОшибки) = Тип("Строка"), ТекстОшибки, ""));
	Результат = ar_JSON.ВЗначениеJSON(Объект);
	Возврат ?(ПустаяСтрока(Результат), "{""error"":""tool_error""}", Результат);
КонецФункции

// Описание tool update_plan для регистрации в ar_Tools.
//
// Возвращаемое значение:
//  Структура - поля Имя, Описание, КраткоеОписание, ОбщийМодуль, ИмяПроцедуры,
//  RiskLevel, ТребуетApproval, Включён, Версия, JSONManifest.
//
Функция ОписаниеToolUpdatePlan()

	// OpenAI tool-format (parameters, не Anthropic input_schema) - единый
	// контракт для всех LLM-провайдеров (образец: ar_ToolРеестрПоиск.ОписаниеToolFindTools).
	МанифестJSON = "{
	|  ""type"": ""function"",
	|  ""function"": {
	|    ""name"": ""update_plan"",
	|    ""description"": ""Объявить или обновить план работы по многоэтапной задаче. Вызывай на задачах из нескольких шагов, чтобы оператор видел прогресс. План - твоё намерение: переписывай его, если обстоятельства изменились."",
	|    ""parameters"": {
	|      ""type"": ""object"",
	|      ""required"": [""steps""],
	|      ""properties"": {
	|        ""steps"": {
	|          ""type"": ""array"",
	|          ""items"": {
	|            ""type"": ""object"",
	|            ""properties"": {
	|              ""title"": { ""type"": ""string"", ""description"": ""Краткий заголовок шага плана, до 150 символов."" },
	|              ""status"": { ""type"": ""string"", ""enum"": [""pending"", ""in_progress"", ""done"", ""skipped""], ""description"": ""Статус шага. Неизвестное или отсутствующее значение трактуется как pending."" }
	|            },
	|            ""required"": [""title""]
	|          },
	|          ""description"": ""Список шагов плана, до 12 элементов. Присылай полный актуальный список при каждом вызове.""
	|        },
	|        ""note"": {
	|          ""type"": ""string"",
	|          ""description"": ""Опциональный короткий комментарий о текущем состоянии работы.""
	|        }
	|      },
	|      ""additionalProperties"": false
	|    }
	|  }
	|}";

	Описание = Новый Структура;
	Описание.Вставить("Имя",              "update_plan");
	Описание.Вставить("Описание",
		НСтр("ru = 'Объявить или обновить план работы по многоэтапной задаче. Вызывай на задачах из нескольких шагов, чтобы оператор видел прогресс. План — твоё намерение: переписывай его, если обстоятельства изменились.';
		|en = 'Announce or update the work plan for a multi-step task. Call it on tasks with several steps so the operator can see progress. The plan is your intent: rewrite it if circumstances change.'"));
	Описание.Вставить("КраткоеОписание",
		НСтр("ru = 'Объявить или обновить план работы';
		|en = 'Announce or update the work plan'"));
	Описание.Вставить("ОбщийМодуль",      "ar_ToolПлан");
	Описание.Вставить("ИмяПроцедуры",     "ОбновитьПлан");
	Описание.Вставить("RiskLevel",        "Read");
	Описание.Вставить("ТребуетApproval",  Ложь);
	Описание.Вставить("Включён",          Истина);
	Описание.Вставить("Версия",           "1.0.0");
	Описание.Вставить("JSONManifest",     МанифестJSON);
	Возврат Описание;

КонецФункции

// Создать или обновить одну запись в ar_Tools по описанию.
// Ищет по ar_Имя среди непомеченных. При нахождении — обновляет, иначе создаёт.
// ar_Категория здесь сознательно НЕ заполняется - постпроход
// ar_ToolDispatcher.ЗаполнитьПредставленияВсехTools() делает это после
// регистрации всех модулей (спека PLAN-03, «Сущности и метаданные»).
//
// Параметры:
//  Описание   - Структура - см. ОписаниеToolUpdatePlan.
//  Статистика - Структура - {Создано, Обновлено} - модифицируется по ссылке.
//
Процедура ЗарегистрироватьОдинИнструмент(Знач Описание, Статистика)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Tools.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ar_Tools КАК Tools
		|ГДЕ
		|	Tools.ar_Имя = &Имя
		|	И НЕ Tools.ПометкаУдаления";
	Запрос.УстановитьПараметр("Имя", Описание.Имя);

	Выборка = Запрос.Выполнить().Выбрать();

	НачатьТранзакцию();
	Попытка
		Если Выборка.Следующий() Тогда
			ОбъектИнструмент = Выборка.Ссылка.ПолучитьОбъект();
			Статистика.Обновлено = Статистика.Обновлено + 1;
		Иначе
			ОбъектИнструмент = Справочники.ar_Tools.СоздатьЭлемент();
			Статистика.Создано = Статистика.Создано + 1;
		КонецЕсли;

		ОбъектИнструмент.Наименование        = Описание.Имя;
		ОбъектИнструмент.ar_Имя              = Описание.Имя;
		ОбъектИнструмент.ar_Описание         = Описание.Описание;
		ОбъектИнструмент.ar_КраткоеОписание  = Описание.КраткоеОписание;
		ОбъектИнструмент.ar_ОбщийМодуль      = Описание.ОбщийМодуль;
		ОбъектИнструмент.ar_ИмяПроцедуры     = Описание.ИмяПроцедуры;
		ОбъектИнструмент.ar_ТребуетApproval  = Описание.ТребуетApproval;
		ОбъектИнструмент.ar_Включён          = Описание.Включён;
		ОбъектИнструмент.ar_Версия           = Описание.Версия;
		ОбъектИнструмент.ar_JSONManifest     = Описание.JSONManifest;

		// Установка RiskLevel через перечисление (образец: ar_ToolРеестрПоиск.ПолучитьУровеньРиска).
		ОбъектИнструмент.ar_RiskLevel = ПолучитьУровеньРиска(Описание.RiskLevel);

		// Справочник записывается без параметров.
		ОбъектИнструмент.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Получить ссылку перечисления ar_RiskLevel по строковому имени.
// При неизвестном имени возвращает Read (безопасный дефолт).
//
// Параметры:
//  ИмяЗначения - Строка - имя значения перечисления ar_RiskLevel.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ar_RiskLevel - найденное значение либо Read по умолчанию.
//
Функция ПолучитьУровеньРиска(Знач ИмяЗначения)
	Если ТипЗнч(ИмяЗначения) <> Тип("Строка") Тогда
		Возврат Перечисления.ar_RiskLevel.Read;
	КонецЕсли;
	Для Каждого ЗначМД Из Метаданные.Перечисления.ar_RiskLevel.ЗначенияПеречисления Цикл
		Если ЗначМД.Имя = ИмяЗначения Тогда
			Возврат Перечисления.ar_RiskLevel[ЗначМД.Имя];
		КонецЕсли;
	КонецЦикла;
	Возврат Перечисления.ar_RiskLevel.Read;
КонецФункции

#КонецОбласти
